IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28003x_epg_mux_regs.xml
<module id="EPG_MUX_REGS" HW_revision="" description="EPG MUX Registers">
	<register id="EPGMXSELLOCK" width="32" page="1" offset="0xc" internal="0" description="EPG Mux select register lock">
		<bitfield id="EPGMXSEL0" description="EPGMXSEL0 lock bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="EPGMXSELCOMMIT" width="32" page="1" offset="0xe" internal="0" description="EPG Mux select register commit">
		<bitfield id="EPGMXSEL0" description="EPGMXSEL0 commit bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
